In [1]:
# use sqlite3 in python 
import sqlite3 as sql3
import pandas as pd

In [2]:
# create a connection to database
connection = sql3.connect("simple_tables.db")

In [3]:
# create a cursor obj to do sql queries 
cursor = connection.cursor()

In [4]:
# create a table 
cursor.execute(""" 
CREATE TABLE IF NOT EXISTS table1 (
               id integer primary key,
               name text not null, 
               age integer,
               level integer)
"""
)

In [ ]:
# insert row into the table 
# if you run it again, it wont allow you to add because the id is the primary key, it has to be unique  
cursor.execute("insert into table1 (id, name, age, level) values (001, 'emma', 19, 1)")
cursor.execute("insert into table1 (id, name, age, level) values (002, 'dave', 20, 2)")
cursor.execute("insert into table1 (id, name, age, level) values (003, 'richard', 20, 1)")

In [6]:
# commit the changes 
connection.commit()

In [5]:
# query the table 
cursor.execute("SELECT * FROM table1 where level = 2")
results = cursor.fetchall()

In [6]:
type(results) # check its data type, we want the restults as data frame or dictionary

list

In [7]:
# display the results 
for res in results:
    print(res)

(2, 'dave', 20, 2)

In [8]:
# get a query in a string and run it using pandas 
query = "SELECT * FROM table1 where level = 2"
df = pd.read_sql_query(query, connection)

In [9]:
df.head() # output is data frame now, not a list anymore

   id  name  age  level
0   2  dave   20      2

In [9]:
# close the connection if not in use 
connection.close()